{ 
    "pipeline": "PaM Info RVI viral metagenomics pipeline",
    "params": {
        "Logging options": {
            "monochrome_logs": {
                "default": "false",
                "help_text": "Should logs appear in plain ASCII"
            }
        },
        "Top-level workflow options": {
            "skip_preprocessing": {
                "default": "false",
                "help_text": "Should reads pre-processing (including Kneaddata or just Trimmomatic) be run at all? Relevant if pre-processing is done upstream in a separate pipeline."
            },
            "metaspades_subsample_limit": {
                "default": 10000000,
                "help_text": "minimum number of reads (in a single paired-end read file, so double that for total counts when summing from both files) to trigger read subsampling ahead of any pipeline step, including pre-processing."
            }
        }
    },
    "overwrite_param": {
        "cleanup_intermediate_files_irods_extractor": {
            "default": "true",
            "help_text": "delete intermediate CRAM files downloaded from IRODS in work/ folder"
        },
        "preexisting_fastq_tag": {
            "default": "trimmed_reads",
            "help_text": "if the expected ouput fastq files exist in the folder named like this under the result folder for the sample e.g. in results/12345_1#67/trimmed_reads/12345_1#67_1.fastq.gz,\n            then skip download and any further processing for this sample. Default value 'trimmed_reads' means the run skips items for which the output for the PREPROCESSING subworkflow already exists."
        },
        "split_sep_for_ID_from_fastq":{
            "default": "_1_kneaddata_paired_1.fastq",
            "help_text": "separator to recognise sample ID from preexisting file."
        },
        "instrain_profile_options": {
            "default": "--min_genome_coverage 0 --min_read_ani 0.9",
            "help_text": "profiling parameters for inStrain standard abundance estimation method; default for RVI pipeline is '--min_genome_coverage 0 --min_read_ani 0.9', not '--database-mode'."
        },
        "subsample_limit": {
            "default": 500000,
            "help_text": "minimum number of total reads (i.e. summing counts in both paired-end read files) to trigger read subsampling ahead of metagenomic assembly"
        },
        "genome_file_abundance_estimation": {
            "default": "/data/pam/software/RVI_DB/viral.1.1.genomic_sorted.fna",
            "help_text": "reference genome database for mapping with Bowtie2 prior to abundance estimation with inStrain (mandatory)."
        },
        "precomputed_index_abundance_estimation": {
            "default": "/data/pam/software/RVI_DB/viral.1.1.genomic_sorted.bt2",
            "help_text": "Pre-computed Bowtie2 index for reference genome database prior to abundance estimation with inStrain (mandatory)."
        },
        "stb_file_abundance_estimation": {
            "default": "/data/pam/software/RVI_DB/viral.1.1.genomic.stb",
            "help_text": "'Scaffold-to-Bin' table (matches assembly accessions with contig sequence accessions) for inStrain."
        },
        "custom_taxon_names_abundance_estimation": {
            "default": "/data/pam/software/RVI_DB/handpicked_viral_taxa_short_names_dict.txt",
            "help_text": "dictionary of taxon names (as provided in value field of STB file --stb_file_abundance_estimation) to custom names, used for ad-hoc relabelling. A 2-column TSV format expected; this may only feature a subset of taxa included in the database."
        },
        "metaspades_base_mem_gb": {
            "default": 16,
            "help_text": "memmory in GB from which the METASPADES process will start iterating, doubling at every retry when failed for insufficient memory"
        }
    }
}

